//Опис класу 
class server_socket {
  public:
    //Конструктори класу server_socket:
    server_socket(const in_port_t port); //Приймає значення порту, прослуховання по усім інтерфесам
    server_socket(const char* addr, const int_port_t port); /*Приймає IP адесу мережевого 
    інтерфейсу, який буде прослуховуватися по вказаному порту*/
    //Деструктори класу
    ~server_socket();
    //Закриває файловий дескриптор сокету
    //Методи класу:
    int sopen();
    /*Створює сокет та зі’язує його з мережевим інтерфейсом. Повертає 0, у
    разі невдачи повертає -1.*/
    client_socket saccept();
    //Прослуховує порт, чекає запит на підключення, повертае об’ект типу
    void sclose(); //Закриває файловий дескриптор сокету, кінець сеансу зв’зку.
  private:
    //Поля класу:
    pid_t sid; //Файловий дескриптор сокету
    struct sockaddr_in s_addr;
};

//Опис класу 
class client_socket {
  public:
    //Конструктори класу client_socket:
    client_socket(const pid_t sid, struct sockaddr_in s_addr);
    /*Приймає файловий дескриптор кліент сокету, та його структуру. Сокет
    вже створенний функціей saccept(), цей конструктор сокет не створює,
    він тільки приймає параметри вже існуючего сокету.*/
    client_socket(const char* addr, const int_port_t port);
    //Приймає IP адесу серверу, та порт, до якого буде здіснено підключення.
    //Деструктори класу
    ~client_socket();
    //Закриває файловий дескриптор сокету
    //Методи класу:
    int sopen();
    /*Створює сокет та робиться спроба підключитися до серверу. Повертає 0,
    у разі невдачи повертає -1.*/
    string sread(int& status);
    /*Читає данні з сокету та повертае рядок типу string. Успішність
    виконання операції повертається через параметр status (0 – Операція
    успішна, -1 у разі невдачи)*/
    int swrite(const string& s);
    //Записує рядок у сокет. Повертає 0, у разі невдачи повертає -1.
    void sclose();
    // Закриває файловий дескриптор сокету, кінець сеансу зв’зку.
    string get_addr();
    /* Повертає IP адресу сокета клієнта у вигляді точечної нотації
    (xxx.xxx.xxx.xxx). */
    in_port_t get_port();
    //Повертає port сокета.
  private:
    //Поля класу:
    pid_t sid;
    //Файловий дескриптор сокету
    struct sockaddr_in s_addr;
};